fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		ДобавитьПоляФормыДляАбонентскогоДоговора();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидАбонентскоеОбслуживание = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание"); 
	
	Если Объект.ВидДоговора = ВидАбонентскоеОбслуживание Тогда
		ДобавитьПоляФормыДляАбонентскогоДоговора();
	Иначе		
		УдалитьПоляФормыДляАбонентскогоДоговора();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ДобавитьГруппуЭлементыАбонентскогоДоговора()
	
	Группа = Элементы.Добавить("ГруппаЭлементыАбонентскогоДоговора", Тип("ГруппаФормы"), ЭтаФорма);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "Дополнительные реквизиты Абонентского договора";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуПериодДействия()
	
	Группа = Элементы.Добавить("ГруппаПериодДействия", Тип("ГруппаФормы"), Элементы.ГруппаЭлементыАбонентскогоДоговора);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Заголовок = "Период действия";
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуАбонПлатаИСтоимостьЧаса()
	
	Группа = Элементы.Добавить("ГруппаАбонПлатаИСтоимостьЧаса", Тип("ГруппаФормы"), Элементы.ГруппаЭлементыАбонентскогоДоговора);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеНачалоПериодаДействия()
	
	ПолеВвода = Элементы.Добавить("НачалоПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_НачалоПериодаДействия";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеОкончаниеПериодаДействия()
	
	ПолеВвода = Элементы.Добавить("ОкончаниеПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ОкончаниеПериодаДействия";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеАбонентскаяПлата()
	
	ПолеВвода = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), Элементы.ГруппаАбонПлатаИСтоимостьЧаса);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеСтоимостьЧаса()
	
	ПолеВвода = Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"), Элементы.ГруппаАбонПлатаИСтоимостьЧаса);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Насервере
Процедура ДобавитьПоляФормыДляАбонентскогоДоговора()
	
	ДобавитьГруппуЭлементыАбонентскогоДоговора();
	ДобавитьГруппуПериодДействия();
	ДобавитьГруппуАбонПлатаИСтоимостьЧаса();
	ДобавитьПолеНачалоПериодаДействия();
	ДобавитьПолеОкончаниеПериодаДействия();
	ДобавитьПолеАбонентскаяПлата();
	ДобавитьПолеСтоимостьЧаса()
	
КонецПроцедуры

&Насервере
Процедура УдалитьПоляФормыДляАбонентскогоДоговора()
	
	ГруппаЭлементыАбонентскогоДоговора = Элементы.Найти("ГруппаЭлементыАбонентскогоДоговора");
	
	Если ГруппаЭлементыАбонентскогоДоговора = Неопределено Тогда
		Возврат;
	Иначе
		Элементы.Удалить(ГруппаЭлементыАбонентскогоДоговора);
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
